Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་འཁོར་ལོ་རིན་པོ་ཆེ་གང་དུ་མཆི་བ་དེར་དཔུང་གི་ཚོགས་ཐམས་ཅད་མཆིའོ། །
en: As an analogy, Blessed One, wherever the precious wheel of a universal monarch goes, there too go his army battalions.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོ་གང་དུ་མཆི་བ་དེར་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མཆིའོ། །
en: Likewise, Blessed One, wherever a bodhisattva’s great compassion goes, so too do all the Buddha’s qualities.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་གདུགས་ཤར་ན་སེམས་ཅན་རྣམས་ཀྱི་བགྱི་བ་ཐམས་ཅད་ཤིན་དུ་མང་བར་འགྱུར་རོ། །
en: As another analogy, Blessed One, once the sun has risen, the activities of beings multiply.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་སྙིང་རྗེ་ཆེན་པོ་གང་དུ་ཤར་བར་གྱུར་པ་དེར་བྱང་ཆུབ་བགྱིད་པའི་ཆོས་ཀྱི་བགྱི་བ་གཞན་རྣམས་ཀྱང་ཤིན་དུ་མང་བར་འགྱུར་རོ། །
en: Likewise, Blessed One, wherever great compassion has arisen, the other Dharma activities that bring about awakening also multiply.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་སྲོག་གི་དབང་པོ་མཆིས་ན་དབང་པོ་གཞན་རྣམས་འབྱུང་བར་འགྱུར་རོ། །
en: As another analogy, Blessed One, wherever there is the life faculty, the other faculties also appear.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་སྙིང་རྗེ་ཆེན་པོ་མཆིས་ན་བྱང་ཆུབ་བགྱིད་པའི་ཆོས་གཞན་རྣམས་ཀྱང་འབྱུང་བར་འགྱུར་ཏེ།
en: Likewise, Blessed One, wherever great compassion is present, all the other factors that bring about awakening are present.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བརྟན་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ནི་ཆོས་རྣམས་ཀྱི་རྩ་བ་སྟེ།
en: The bodhisattva Dṛḍhamati said, “Blessed One, perfect intention is the root of all qualities.

source: གང་ལ་བསམ་པ་མ་མཆིས་པ་དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རིང་བ་ལགས་སོ། །
en: Those who lack intention are far removed from all the qualities of the buddhas.

source: བཅོམ་ལྡན་འདས་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་གལ་ཏེ་སངས་རྒྱས་མི་བཞུགས་ན་ཡང་ནམ་མཁའི་དཀྱིལ་དང་། རྩིག་པ་དང་། ཤིང་རྣམས་ལས་ཆོས་འབྱུང་ངོ་། །
en: When there is perfect intention, Blessed One, the Dharma will arise from the center of space, from a wall, or from trees when a buddha is not present.

source: བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་དག་པ་ནི་རང་གི་ཡིད་ཀྱི་དཔྱོད་པ་ཉིད་ལས་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་ཐམས་ཅད་འབྱུང་ངོ་། །
en: For bodhisattvas with pure intention, all advice and instructions spring from the activity of their own minds.

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བསམ་པ་ཕུན་སུམ་ཚོགས་པར་བགྱིའོ། །
en: Therefore, Blessed One, bodhisattvas should perfect intention.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་གང་ལ་རྐང་པ་མཆིས་པ་དེ་ལ་འགྲོ་བ་མཆིས་སོ། །
en: “As an analogy, Blessed One, a person with legs can walk.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་ལ་བསམ་པ་མཆིས་པ་དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མཆིས་སོ། །
en: Likewise, Blessed One, a person with intention has the qualities of a buddha.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་ཡན་ལག་གི་དམ་པ་མགོ་གང་ལ་མཆིས་པ་དེ་ལ་འཚོ་བ་མཆིས་སོ། །
en: As another analogy, Blessed One, a person with a head, the best of limbs, has life.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བསམ་པ་གང་ལ་མཆིས་པ་དེ་ལ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མཆིས་སོ། །
en: Likewise, Blessed One, a person with intention has the awakening of a buddha.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་གང་ལ་འཚོ་བ་མཆིས་པ་དེ་ལ་རྙེད་པ་མཆིས་སོ། །
en: As another analogy, Blessed One, a person who has life has wealth.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་ལ་བསམ་པ་མཆིས་པ་དེ་ལ་སངས་རྒྱས་རྙེད་པ་མཆིས་སོ། །
en: Likewise, Blessed One, a person who has intention has the wealth of buddhahood.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་ཞུགས་ཤིང་མཆིས་ན་ཞུགས་འབར་གྱི་ཞུགས་ཤིང་མ་མཆིས་ན་ཞུགས་མི་འབར་རོ། །
en: As another analogy, Blessed One, where there is firewood a fire can be lit, but where there is no wood a fire cannot be lit.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བསམ་པ་མཆིས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་འབར་གྱི་བསམ་པ་མ་མཆིས་པ་ལ་མི་འབར་རོ། །
en: Likewise, Blessed One, the qualities of buddhahood ignite for bodhisattvas with intention, but not for those who do not.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་སྤྲིན་ཆགས་ན་ཆར་འབབ་ཀྱི།
en: As another analogy, Blessed One, rain falls where storm clouds gather.

source: སྤྲིན་མ་ཆགས་ན་ཆར་མི་འབབ་པོ། །
en: Rain does not fall where they do not.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བསམ་པ་མཆིས་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་འབྱུང་གི་བསམ་པ་མ་མཆིས་ན་མི་འབྱུང་ངོ་། །
en: Likewise, Blessed One, where there is intention the qualities of the Buddha develop, but they do not where there is no intention.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་ཞུགས་ཤིང་གང་རྩ་བ་ཉམས་པ་དེ་ལ་མེ་ཏོག་དང་འབྲས་བུ་རྣམས་མི་འཁྲུང་ངོ་། །
en: As another analogy, Blessed One, a tree with a rotten root will not yield flowers and fruit.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་བསམ་པ་ལོག་པར་ཞུགས་པ་དེ་དག་ལ་དགེ་བའི་ཆོས་ཐམས་ཅད་མི་འབྱུང་ངོ་། །
en: Likewise, Blessed One, perverted intentions will not yield virtuous qualities.

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཚོལ་བས་རང་གི་བསམ་པ་ཤིན་ཏུ་གཟུང་བ་དང་། ཤིན་ཏུ་བསྲུང་བ་དང་། ཤིན་ཏུ་སྦྱང་བར་བགྱི་སྟེ།
en: “Therefore, Blessed One, bodhisattvas who seek the awakening of a buddha will hold firm to their intention, guard it carefully, and purify it thoroughly.

source: བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཟང་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་ཆོས་གང་ཡང་འཁྲུགས་པར་མི་བགྱིའོ། །
en: The bodhisattva Excellent Discipline said, “Blessed One, a bodhisattva does not disturb phenomena in any way.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་རང་གི་སེམས་ཤིན་ཏུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, bodhisattvas control their own minds.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་རང་གི་སེམས་ལ་རག་ལས་པའོ། །
en: Blessed One, all a bodhisattva’s buddha qualities are dependent on their own mind.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་འགའ་ཞིག་འཁྲུགས་པར་བགྱིད་ན། དེ་ཚེགས་ཆེན་པོས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་འཐོབ་པར་འགྱུར་རོ། །
en: If bodhisattvas were to disturb some phenomenon, it would require great difficulty for them to attain acceptance that phenomena do not arise.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་གང་ཡང་འཁྲུགས་པར་མི་བགྱིད་པ་དང་། བསམ་གཏན་དུ་བགྱིད་པ་དེ་མ་ཉམས་པར་གནས་པ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ནོངས་པ་མ་མཆིས་པར་འགྱུར་རོ། །
en: Blessed One, bodhisattvas who do not disturb phenomena and cultivate meditative stability will continue without decline, and they will cause no offense to the thus-gone ones.

source: རང་གི་སེམས་ལས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་རྟོགས་ཏེ། སེམས་དེ་ཡང་འཁྲུགས་པར་མི་བགྱིད་དོ། །
en: They realize that all the qualities of a buddha depend on their own mind, and they will do nothing to agitate it.

source: ཇི་ལྟར་སེམས་དེ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་མཐོང་ངོ་། །
en: They see that all phenomena, like the mind, arise through dependent arising.

source: ཇི་ལྟར་སེམས་དེ་སྒྱུ་མ་ལྟ་བུར་མཐོང་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་སྒྱུ་མ་ལྟ་བུར་མཐོང་ངོ་། །
en: They see that all phenomena are illusory in the same way they see the mind as illusory.

source: ཇི་ལྟར་སེམས་དེ་ནང་དང་། ཕྱི་རོལ་དང་། གཉི་ག་མ་མཆིས་པར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: They correctly see all phenomena in the same way that they correctly see that the mind is neither internal, external, nor both.

source: ཇི་ལྟར་སེམས་དེ་གཟུགས་མ་མཆིས། བསྟན་དུ་མ་མཆིས། ཐོགས་པ་མ་མཆིས། སྣང་བ་མ་མཆིས། རྣམ་པར་རིག་པ་མ་མཆིས།
en: They see that all phenomena are like the mind in being without form, indescribable, unimpeded, unmanifest, unknowable, without support, and without basis.

source: རྟེན་པ་མ་མཆིས། གནས་མ་མཆིས་པར་མཐོང་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་མཐོང་ངོ་། །དེ་ལྟར་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་སྙོམས་པ་ཉིད་ཐོབ་བོ། །
en: “Bodhisattvas who see these things have attained mental equanimity.

source: དེ་སེམས་སྙོམས་པ་ཉིད་ཐོབ་པས་ཡང་མི་རྟོག །མི་ལྡོག་མི་འདོར། མི་འཛིན་མི་སྨོན་ཏོ། །
en: Because of attaining this mental equanimity, they do not conceptualize, regress, give up, cling, or aspire.

source: གང་མི་སྨོན་པ་དེ་མི་འཛིན་ཏོ། །གང་མི་འཛིན་པ་དེ་ཡོངས་སུ་མི་འཛིན་ཏེ། ཡང་ཉོན་མོངས་པར་མི་འགྱུར་རོ། །
en: They do not cling to what they do not wish for, they do not grasp at what they do not cling to, and they do not become afflicted.

source: ཉོན་མོངས་པ་མ་མཆིས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོན་ཏེ།
en: Bodhisattvas free of affliction teach with all the qualities of a buddha.

source: བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་མཛོད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་གང་གིས་སེམས་ཅན་རྣམས་ལ་གནོད་པར་འགྱུར་བའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: The bodhisattva Gaganagañja said, “Blessed One, bodhisattvas do not speak words that harm beings.

source: གང་གིས་གཞན་ལ་གདུང་བར་འགྱུར་བའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: They do not speak words that hurt others.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གཞན་གྱིས་འཚལ་བར་མི་འགྱུར་བའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: Bodhisattvas do not speak words that others will not understand.

source: གང་གཞན་གྱི་དོན་མ་ལགས་པ་དང་། དོན་མ་མཆིས་པའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: They do not speak words that do not have meaning for others or that are meaningless.

source: གང་གིས་རིག་པ་མི་སྐྱེད་པའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: They do not speak words that do not foster knowledge.

source: གང་སེམས་ཅན་རྣམས་ཀྱི་སྙིང་ལ་མི་འབབ་པ་དང་། འཁོར་གོ་བ་མ་ལགས་པ་དང་། རྣར་མི་སྙན་པའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: They do not speak words that fail to penetrate the hearts of beings, that are not intelligible to ordinary people, or that are not pleasing to the ear.

source: གང་གཉིས་ལ་སྤྱོད་པར་འགྱུར་བའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: And they do not speak words that are ambiguous.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་མི་འགྱུར་བའི་ཚིག་དེ་སྨྲ་བར་མི་བགྱིའོ། །
en: Blessed One, bodhisattvas do not speak words that do not bring about an understanding of emptiness.

source: གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བགྱིད་པའི་ཚིག་དེ་ནི་ཚིག་ཐམས་ཅད་ཀྱི་མཆོག་གོ། །
en: Because words that bring about an understanding of emptiness are the best of all words.

source: བཅོམ་ལྡན་འདས་གང་ཆོས་ཐམས་ཅད་སྟོང་པ་དང་། གཡོ་བ་མ་མཆིས་པ་དང་། མི་གཉིས་པ་དང་། གཉིས་དང་བྲལ་བར་མཐོང་ཡང་སེམས་ཅན་གྱི་བགྱི་བ་ཐམས་ཅད་ཀྱང་མི་འདོར་བ་འདི་ནི་དེའི་སྒྲིབ་པ་མ་མཆིས་པའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: “Blessed One, it is unobstructed great compassion to see that all phenomena are empty, unmoving, nondual, and free of duality while not rejecting any activity on behalf of beings.

source: ཡང་སྒྲིབ་པ་མ་མཆིས་པའི་སྙིང་རྗེ་ཆེན་པོས་སྤྱོད་པ་དེ་སངས་རྒྱས་ཀྱི་བསླབ་པ་རྣམས་ལ་སློབ་བོ། །གང་སངས་རྒྱས་ཀྱི་བསླབ་པ་རྣམས་ལ་སློབ་པ་དེ་ནི་ནམ་མཁའི་མཛོད་འཐོབ་བོ། །དེ་ནས་ནམ་མཁའི་མཛོད་ཐོབ་པས་ཅི་འཚལ་བ་རྣམས་ཡོངས་སུ་གཏོང་བར་བགྱིད་ཀྱང་གཏོང་བ་དང་སེར་སྣ་ལ་གཉིས་སུ་འདུ་ཤེས་པ་མ་ལགས། ཚུལ་ཁྲིམས་ལ་མ་ལགས། འཆལ་བའི་ཚུལ་ཁྲིམས་ལ་མ་ལགས།
en: Also, those whose conduct is based on unobstructed great compassion train in the trainings of the buddhas, and those who train in the trainings of the buddhas attain the sky treasury.

source: བཟོད་པ་ལ་མ་ལགས། གནོད་སེམས་ལ་མ་ལགས། བརྩོན་འགྲུས་ལ་མ་ལགས། ལེ་ལོ་ལ་མ་ལགས། བསམ་གཏན་ལ་མ་ལགས།
en: They then give away whatever they receive from the sky treasury without perceiving a difference between munificence and stinginess, discipline and poor discipline, patience and animosity, diligence and laziness, meditative stability and distraction, or insight and poor insight.

source: རྣམ་པར་གཡེང་བ་ལ་མ་ལགས། ཤེས་རབ་ལ་མ་ལགས། འཆལ་བའི་ཤེས་རབ་ལ་མ་ལགས་ཏེ། དེ་སངས་རྒྱས་ཀྱི་ཆོས་ལ་ཡང་མི་སྨོན། སོ་སོའི་སྐྱེ་བོའི་ཆོས་ཀྱང་ཡོངས་སུ་མི་འདོར་རོ། །
en: They do not aspire for buddhahood, nor do they reject the ways of ordinary beings.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོར་ཆབ་འབབ་པོ་འཚལ་བ་ནི་འདི་ལྟ་སྟེ། ལན་ཚྭའི་རོར་རོ་གཅིག་གོ། །
en: “As an analogy, Blessed One, the waters that flow into the great ocean become uniformly salty.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དོན་དམ་པ་ལ་མཁས་པ་ལ་ཆོས་གང་དག་སྣང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ནི་འདི་ལྟ་སྟེ། རྣམ་པར་གྲོལ་བའི་རོར་རོ་གཅིག་པར་འགྱུར་རོ། །
en: Likewise, for bodhisattvas who are wise about ultimate truth, all phenomena that appear are uniformly liberated.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་གདུགས་ནི་དངོས་པོ་ཐམས་ཅད་སྣང་བར་བགྱིད་དོ། །
en: As another analogy, Blessed One, the sun illuminates all things.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཤེས་རབ་ཀྱིས་ཆོས་ཐམས་ཅད་སྣང་བར་བགྱིད་དོ། །
en: Likewise, Blessed One, bodhisattvas illuminate all phenomena with their insight.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་དུ་འགལ་བ་མ་མཆིས་ཏེ།
en: “Blessed One, there is no contradiction in all things being emptiness.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་དེ་ལྟར་འཚལ་བ་དེ་ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: Blessed One, bodhisattvas who understand this correctly see all phenomena as awakening.

source: གང་ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེ་གང་ཅུང་ཟད་སྨྲ་བ་དེ་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་གསུང་དུ་འཚལ་ཏོ། །
en: Those who correctly see all phenomena as awakening and who say very little know everything as the word of the Buddha.

source: གང་དེ་ལྟར་འཚལ་བ་དེ་ཆགས་པ་མ་མཆིས་པར་སྟོན་ཏོ། །གང་ཆགས་པ་མ་མཆིས་པར་སྟོན་པ་དེ་སྤོབས་པ་ཐོགས་པ་མ་མཆིས་པ་ཞེས་བགྱི་སྟེ།
en: Those who understand this teach without attachment, and those who teach without attachment are known to have unobstructed confident eloquence.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་ཕ་རོལ་ཏུ་ཕྱིན་པ་རབ་ཏུ་ཕྱེ་བ་ལགས་ན། བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ལོག་པར་འཛིན་པ་ནི་འདི་སྐད་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པས་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་ཕྱེའོ་ཞེས་མཆིའོ། །
en: Youthful Mañjuśrī next addressed the Blessed One: “If a bodhisattva were to define the perfections, Blessed One, mistaken worldly people would say, ‘A bodhisattva is defined by the perfections.’

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཕ་རོལ་ཏུ་ཕྱིན་པས་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་ཕྱེ་བ་ལགས་ན་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་རོ། །
en: If, Blessed One, a bodhisattva were defined by the perfections, all beings would also be bodhisattvas.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྐྱེད་པ་དང་ཁོང་དུ་ཆུད་པ་ལགས་ཏེ།
en: Blessed One, bodhisattvas cultivate and understand the perfections.

source: བསྐྱེད་ནས་ཀྱང་གཞན་དག་ལ་ཡང་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ།
en: Once they have been cultivated, they then explain them to others.

source: དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ནི་མ་སྐྱེས་པའི་ལམ་སྐྱེད་པ། མ་བྱུང་བའི་ལམ་འབྱིན་པ། མ་བརྗོད་པ་རྗོད་པའོ་ཞེས་བགྱིའོ། །
en: For that reason, Blessed One, bodhisattvas are said to cultivate an unborn path, present an unarisen path, and express the inexpressible.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱིས་བསྲུང་བ་མ་ལགས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྲུང་བ་བགྱིད་དེ།
en: Blessed One, bodhisattvas are not protected by the perfections; rather, they protect the perfections.

source: དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དམ་པའི་ཆོས་འཛིན་པ་ཞེས་བགྱིའོ། །
en: For that reason bodhisattvas are said to uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱིས་ཀུན་དུ་བཟུང་བ་མ་ལགས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀུན་ཏུ་འཛིན་པར་བགྱིད་དེ།
en: Blessed One, bodhisattvas are not held by the perfections; rather, bodhisattvas uphold the perfections.

source: དེའི་སླད་དུ་ཆོས་འཛིན་པ་ཞེས་བགྱིའོ། །
en: For this reason they are said to be Dharma holders.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་དྲི་མ་མ་མཆིས་པས་སྐྱོན་མ་མཆིས་པའོ། །
en: “Blessed One, because all phenomena are essentially stainless, they are without fault.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་དང་བདག་དབེན་པས་གནས་པ་མ་མཆིས་པའོ། །
en: Blessed One, because all phenomena are devoid of beings and the self, they have no basis.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་བླང་བ་དང་དོར་བ་མ་མཆིས་པས་སེམས་མ་མཆིས་པའོ། །
en: Blessed One, because no phenomena are involved in accepting and rejecting, they have no mind.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་བརྩམས་པ་མ་མཆིས་པས་ཡིད་མ་མཆིས་པའོ། །
en: Blessed One, because no phenomena are undertaken, they have no thought process.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་བརྩམས་པ་དང་བྲལ་བས་རྙིང་པ་མ་ལགས་པའོ། །
en: Blessed One, because no phenomena begin, they do not age.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་མི་གཡོ་ཞིང་གཡོ་བ་མ་མཆིས་པས་འགྲོ་བ་དང་བྲལ་བའོ། །
en: Blessed One, because all phenomena neither move nor do not move, they are free of going.

source: ཆོས་ཐམས་ཅད་ནི་སྲོག་མ་མཆིས་པས་མི་འཆི་བའོ། །
en: Because no phenomena live, they do not die.

source: ཆོས་ཐམས་ཅད་ནི་ཟས་མ་མཆིས་པས་གསོ་བ་མ་མཆིས་པའོ། །
en: Because no phenomena are food, they do not nourish.

source: ཆོས་ཐམས་ཅད་ནི་འདུས་ནས་འགྲུབ་པས་རྫས་མ་མཆིས་པའོ། །
en: Because all phenomena are created through aggregation, they are not substantial.

source: ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་དང་དབྱེར་མ་མཆིས་པས་དམན་པ་མ་ལགས་སོ། །
en: Because all phenomena are inseparable from the expanse of phenomena, there is no inferiority.

source: ཆོས་ཐམས་ཅད་ནི་ལུས་མ་མཆིས་པས་དབྱེར་མ་མཆིས་པའོ། །
en: Because no phenomena are embodied, they are not divisible.

source: ཆོས་ཐམས་ཅད་ནི་ཡང་དག་པའི་མཐའ་དང་མཚུངས་པས་རྡོ་རྗེ་ལྟ་བུའོ། །
en: Because all phenomena are equal to the limit of reality, it is as if they are indestructible.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་ལྟར་འཚལ་བ་དེ་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་འཚལ་ཏོ། །
en: “Blessed One, bodhisattvas who understand this understand the true state of all phenomena.

source: གང་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་འཚལ་བ་དེ་སྟོང་པ་ཉིད་འཚལ་བའོ། །
en: Those who understand the true state of all phenomena understand emptiness.

source: གང་སྟོང་པ་ཉིད་འཚལ་བ་དེ་སུ་དང་ཡང་མི་རྩོད་དོ། །
en: Those who understand emptiness have no quarrel with anyone.

source: གང་སུ་དང་ཡང་མི་རྩོད་པ་དེ་དགེ་སྦྱོང་གི་ཆོས་ལ་གནས་པའོ། །
en: Those who have no quarrel with anyone maintain the way of a medicant.

source: གང་དགེ་སྦྱོང་གི་ཆོས་ལ་གནས་པ་དེ་གནས་པ་མ་མཆིས་པའི་གང་གནས་པ་མ་མཆིས་པ་དེ་ཡུལ་རྣམས་ལ་མི་ཟག་གོ། །
en: Those who maintain the way of a mendicant do not maintain anything. Those who do not maintain anything do not get lost in sense objects.

source: གང་ཡུལ་རྣམས་ལ་མི་ཟག་པ་དེ་སྐྱོན་མ་མཆིས་པའོ། །
en: Those who do not get lost in sense objects have no faults.

source: གང་སྐྱོན་མ་མཆིས་པ་དེ་ཆོས་ཀྱི་སྐུའོ། །
en: Those who have no faults are the dharmakāya.

source: ཆོས་ཀྱི་སྐུ་གང་ལགས་པ་དེ་དེ་བཞིན་གཤེགས་པའོ། །
en: Those who are the dharmakāya are thus-gone ones.

source: དེ་བཞིན་གཤེགས་པ་གང་ལགས་པ་དེ་མི་གཉིས་པ་གསུང་བའོ། །
en: Those who are thus-gone ones speak nondualistically.

source: གང་མི་གཉིས་པ་གསུང་བ་དེ་འཁོར་བ་ཡང་མི་སྤོང་། མྱ་ངན་ལས་འདས་པ་ཡང་མི་སྒྲུབ་སྟེ།
en: Those who speak nondualistically do not abandon saṃsāra and do not attain nirvāṇa.

source: གཞན་དུ་ན་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་སྤང་བ་སྟོན་ཏེ།
en: Instead, they teach the abandonment of all conceptual constructions.

source: བཅོམ་ལྡན་འདས་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པའོ། །
en: “Blessed One, this is a discourse on the Dharma.

source: ཕྱིན་ཅི་མ་ལོག་པ་ཡང་དག་པར་བརྗོད་པའོ། །
en: It is a discourse on the unerring.

source: སྟོང་པ་ཉིད་ཡང་དག་པར་བརྗོད་པའོ། །མཚན་མ་མ་མཆིས་པ་དང་།
en: It is a discourse on emptiness.

source: སྨོན་པ་མ་མཆིས་པ་དང་། མངོན་པར་འདུ་མི་བགྱིད་པ་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་ཡང་དག་པར་བརྗོད་པའོ། །སྐྱེ་བ་མ་མཆིས་པ་ཡང་དག་པར་བརྗོད་པའོ། །
en: It is a discourse on the signless, wishless, uncompounded, unproduced, unarising, and unborn.

source: ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་བརྗོད་པའོ། །
en: It is a discourse on the Great Vehicle.

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་ཆེན་པོ་ཡང་དག་པར་བརྗོད་པའོ། །
en: It is a discourse on the great turning of the wheel of Dharma.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆེན་པོ་ཡང་དག་པར་བརྗོད་པའོ། །
en: It is a discourse on the great perfections.

source: ས་ཆེན་པོ་ཡང་དག་པར་བརྗོད་པའོ། །
en: It is a discourse on the great bodhisattva levels.

source: ཆོས་ཐམས་ཅད་ཕྱིན་ཅི་མ་ལོག་པ་ཡང་དག་པར་བརྗོད་པའོ། །
en: It is an unmistaken discourse on all phenomena.

source: བཅོམ་ལྡན་འདས་ཆོས་ཡང་དག་པར་བརྗོད་པ་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་དུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་འགོད་པའི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །
en: “Blessed One, bodhisattvas who have received this discourse on the Dharma become universal monarchs who are established on the path of the ten virtues.

source: སེམས་ཅན་ཐམས་ཅད་དགེ་བར་བགྱིད་པའི་ཚོང་དཔོན་དུ་འགྱུར་རོ། །
en: They become merchant captains who create virtue for all beings.

source: ཁྱིམ་གྱི་སྐྱོན་རྣམ་པར་བརྗོད་པའི་ཁྱིམ་བདག་ཆེན་པོར་འགྱུར་རོ། །
en: They become great householders who critique their home.

source: ལྷ་རྣམས་བག་མཆིས་པ་ལ་རབ་ཏུ་སྦྱོར་བའི་ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་དུ་འགྱུར་རོ། །
en: They become Indra, king of the gods, who is dedicated to the vigilance of the gods.

source: བསམ་གཏན་དང་ཚད་མ་མཆིས་པ་རྣམས་ལ་རབ་ཏུ་འགོད་པའི་ཚངས་པར་འགྱུར་རོ། །
en: They become Brahmā, who is established in the boundless dhyānas.

source: འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀྱིས་ཡིད་མི་གོས་པའི་འཇིག་རྟེན་སྐྱོང་བར་འགྱུར་རོ། །
en: They become world guardians whose minds are not tainted by worldly phenomena.

source: མཆོག་ཏུ་རྩོད་པ་མ་མཆིས་པའི་དགེ་སྦྱོང་དུ་འགྱུར་རོ། །
en: They become mendicants who refrain from argument.

source: ཚངས་པའི་ཡུལ་ལ་མཁས་པའི་བྲམ་ཟེར་འགྱུར་རོ། །
en: They become brahmins who know about the Egg of Brahmā.

source: དུལ་ཞིང་གཡོག་ཀྱང་དུལ་བར་འགྱུར་རོ། །
en: “They will be tamed, as will their followers.

source: ཞི་ཞིང་གཡོག་ཀྱང་ཞི་བར་འགྱུར་རོ། །
en: They will be calm, as will their followers.

source: ཅང་ཤེས་ཤིང་གཡོག་ཀྱང་ཅང་ཤེས་པར་འགྱུར་རོ། །
en: They will be refined, as will their followers.

source: དབང་ཆེན་པོ་ཐོབ་པའི་ཐམས་ཅད་དུ་འགྲོ་བར་འགྱུར་རོ། །
en: They will go everywhere there are those who have attained great power.

source: ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པའི་ཆོས་སྨྲ་བ་ཆེན་པོར་འགྱུར་རོ། །
en: They will become great Dharma reciters who cut through all doubt.

source: ཉོན་མོངས་པ་ཟད་པས་མི་འཇིགས་པར་འགྱུར་རོ། །
en: And they will be fearless because their afflictive emotions are exhausted.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཁྱོད་དང་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་དང་ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱིས་སྨྲས་པ་འདི་སེམས་ཅན་གང་དག་གིས་ཁོང་དུ་ཆུད་པ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་ཆུང་ངུ་དང་ལྡན་པ་མ་ཡིན་ནོ། །
en: The Blessed One then spoke to Youthful Mañjuśrī: “Mañjuśrī, any beings who understand what you, these bodhisattvas, and the great śrāvakas have said do not have meager roots of virtue.

source: སངས་རྒྱས་གཅིག་ལ་བསྙེན་བཀུར་བྱས་པ་མ་ཡིན་ནོ། །
en: They have not served a single buddha.

source: དགེ་བའི་རྩ་བ་གཅིག་གི་རྒྱུ་ལས་བྱུང་བ་མ་ཡིན་ནོ། །
en: They are not the result of a single root of virtue.

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་ཟབ་སྟེ།
en: Mañjuśrī, the awakening of the thus-gone ones is profound.

source: བརྟགས་པའི་མཁས་པ་དང་མཛངས་པས་རིག་པའོ། །
en: It is known by those who are astute and learned.

source: འཇམ་དཔལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སེམས་ཅན་དགེ་བའི་རྩ་བ་ཆུང་ངུ་རྣམས་ཀྱིས་ཐོས་པར་མི་འགྱུར་ཏེ། གང་དག་གིས་ཐོས་ཀྱང་དད་པར་མི་འགྱུར་རོ། །
en: Mañjuśrī, this way of the Dharma will not be heard by those with meager roots of virtue, and those who do will not believe it.

source: འདི་ལ་གང་ལུས་མངོན་སུམ་དུ་འགྱུར་བ་དང་། གང་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་དེ་དག་གིས་ཐོས་པར་འགྱུར།
en: It will be heard by those who have experienced it physically, and who are supported by a spiritual friend.

source: འཛིན་པར་འགྱུར་ཏེ། བཟོད་པ་ཡང་ཐོབ་པར་འགྱུར་རོ། །
en: They will grasp it and will attain acceptance.

source: འཇམ་དཔལ་ཆོས་ཀྱི་ཚུལ་འདི་ལ་མ་བརྟེན་པར་སངས་རྒྱས་པ་གང་ཡང་མེད་དོ། །
en: “Mañjuśrī, there are no buddhas who did not follow this way of the Dharma.

source: འཇམ་དཔལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བརྟེན་ནས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Mañjuśrī, all of the blessed buddhas who have reached perfect awakening—equal in number to grains of sand in the Gaṅgā River—have reached perfect awakening after following this way of the Dharma.

source: འཇམ་དཔལ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མ་བརྟེན་པར་བྱང་ཆུབ་འདོད་པ་དེ་དག་ནི་ནམ་མཁའ་ལ་རྙེབ་པས་རྙེབ་པར་རིག་པར་བྱའོ། །
en: Mañjuśrī, those who seek awakening without relying on this way of the Dharma should know they are grasping for the sky.
